## Production: database-tools
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 20 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.blazer_exection_role_parameter_policy_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_exection_role_parameter_policy_actions"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.blazer_task_role_actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "blazer_task_role_actions"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssmmessages:CreateControlChannel",
              + "ssmmessages:CreateDataChannel",
              + "ssmmessages:OpenControlChannel",
              + "ssmmessages:OpenDataChannel",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.blazer will be created
  + resource "aws_cloudwatch_log_group" "blazer" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "blazer"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # aws_db_instance.database-tools will be created
  + resource "aws_db_instance" "database-tools" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "database-tools-rds-subnet"
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "database_tools"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all                              = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0eac71b27829f15ef",
        ]
    }

  # aws_db_subnet_group.database-tools-rds-subnet will be created
  + resource "aws_db_subnet_group" "database-tools-rds-subnet" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "database-tools-rds-subnet"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-003252752c8a83c9f",
          + "subnet-0372dd9f5c68cdf14",
          + "subnet-0c68946095ba18faf",
        ]
      + tags        = {
          + "Name" = "My DB subnet group"
        }
      + tags_all    = {
          + "Name" = "My DB subnet group"
        }
    }

  # aws_ecr_repository.blazer will be created
  + resource "aws_ecr_repository" "blazer" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "database-tools/blazer"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all             = {
          + "CostCenter" = "notification-canada-ca-production"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecs_cluster.blazer will be created
  + resource "aws_ecs_cluster" "blazer" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "blazer"
      + tags_all           = (known after apply)

      + default_capacity_provider_strategy {
          + base              = (known after apply)
          + capacity_provider = (known after apply)
          + weight            = (known after apply)
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.blazer will be created
  + resource "aws_ecs_service" "blazer" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "blazer"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0285edbc328dde553",
            ]
          + subnets          = [
              + "subnet-003252752c8a83c9f",
              + "subnet-0372dd9f5c68cdf14",
              + "subnet-0c68946095ba18faf",
            ]
        }
    }

  # aws_ecs_task_definition.blazer will be created
  + resource "aws_ecs_task_definition" "blazer" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "blazer"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = (known after apply)
    }

  # aws_iam_policy.blazer_exection_role_parameter_policy will be created
  + resource "aws_iam_policy" "blazer_exection_role_parameter_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "blazer_exection_role_parameter_policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_policy.blazer_task_role_policy will be created
  + resource "aws_iam_policy" "blazer_task_role_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "blazer_task_role_policy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.blazer_ecs_task will be created
  + resource "aws_iam_role" "blazer_ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "blazer-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.blazer_execution_role will be created
  + resource "aws_iam_role" "blazer_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "blazer_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.blazer_ecs_task_policy_attach will be created
  + resource "aws_iam_role_policy_attachment" "blazer_ecs_task_policy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "blazer-ecs-task"
    }

  # aws_iam_role_policy_attachment.blazer_exection_role_parameter_policy_actions will be created
  + resource "aws_iam_role_policy_attachment" "blazer_exection_role_parameter_policy_actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "blazer_execution_role"
    }

  # aws_iam_role_policy_attachment.blazer_task_role_actions will be created
  + resource "aws_iam_role_policy_attachment" "blazer_task_role_actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "blazer-ecs-task"
    }

  # aws_iam_role_policy_attachment.ce_cs will be created
  + resource "aws_iam_role_policy_attachment" "ce_cs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "blazer_execution_role"
    }

  # aws_ssm_parameter.db_tools_environment_variables will be created
  + resource "aws_ssm_parameter" "db_tools_environment_variables" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "BLAZER_DATABASE_URL"
      + tags      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_id will be created
  + resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_id" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "notify_o11y_google_oauth_client_id"
      + tags      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # aws_ssm_parameter.notify_o11y_google_oauth_client_secret will be created
  + resource "aws_ssm_parameter" "notify_o11y_google_oauth_client_secret" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "notify_o11y_google_oauth_client_secret"
      + tags      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # aws_ssm_parameter.sqlalchemy_database_reader_uri will be created
  + resource "aws_ssm_parameter" "sqlalchemy_database_reader_uri" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "sqlalchemy_database_reader_uri"
      + tags      = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all  = {
          + "CostCenter" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 20 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>